init.el
; The org-mode verson of the ~few packages~ init.el configuration available at https://github.com/MooersLab/dsw-2024-org-mode-init.
;%  - The number of semicolons indicates the headline level.
;%  - The combintatoin of a semicolon and a precent sign denotes a comment to be converted to prose in the org file.
;%  - The lines without semicolons in the left margin wind up in code blocks.
;%  
;%  - I use the bash command  alias e29f='/Applications/Emacs29.4.app/Contents/MacOS/Emacs --init-directory ~/e29fewpackages --debug-init'
;%  
;; The top section sets up the package management software and must come first.
(setq user-emacs-directory "~/e29fewpackages/")
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))
(straight-use-package 'org)
(setq package-enable-at-startup nil)
(use-package use-package)
(setq straight-use-package-by-default t)
;%  Messages printed to the messages buffer aid in locating bugs in the config file because the bug is somewhere beyond the last message.
(message "Finished straight package manager configuration.") 

;; Globalsettings
;%  The order of the remaining content of the intial.org does not matter but I like to divide it into settings, user-defined functions, and packages.
(message "Start global configuration.") 
;;; Enable mouse in terminal Emacs (emacs -nw)
(when (eq window-system nil)
      (xterm-mouse-mode t))
;;; Minibuffer history keybindings
;%  The calling up of a previously issued command in the minibuffer with ~M-p~ saves times.
(autoload 'edit-server-maybe-dehtmlize-buffer "edit-server-htmlize" "edit-server-htmlize" t)
(autoload 'edit-server-maybe-htmlize-buffer "edit-server-htmlize" "edit-server-htmlize" t)
(add-hook 'edit-server-start-hook 'edit-server-maybe-dehtmlize-buffer)
(add-hook 'edit-server-done-hook  'edit-server-maybe-htmlize-buffer)
(define-key minibuffer-local-map (kbd "M-p") 'previous-complete-history-element)
(define-key minibuffer-local-map (kbd "M-n") 'next-complete-history-element)
(define-key minibuffer-local-map (kbd "<up>") 'previous-complete-history-element)
(define-key minibuffer-local-map (kbd "<down>") 'next-complete-history-element)
;;; Bibtex configuration
(defconst blaine/bib-libraries (list "/Users/blaine/Documents/global.bib"))

;;; For retina displays on Macs 
;%  TCombined with emacs-mac, this gives good PDF quality for [[https://www.aidanscannell.com/post/setting-up-an-emacs-playground-on-mac/][retina display]].
(setq pdf-view-use-scaling t)
;;; PDF default page width behavior
(setq-default pdf-view-display-size 'fit-page)
;;; Custom key sequences.
;%  Delete trailing whitespaces on lines.
(global-set-key (kbd "C-c d") 'delete-trailing-whitespace)
;;; display line numbers. Need with s-l.
(global-display-line-numbers-mode)
;;; highlight current line
;%  This feature aids finding the cursor's current position.
(global-hl-line-mode +1)
(set-face-background hl-line-face "wheat1")
(set-face-attribute 'mode-line nil  :height 180)
;;; Shell configuration
;%  Let Emacs know which shell that you are using.
(use-package exec-path-from-shell
  :straight t
  :init
  (setenv "SHELL" "/opt/local/bin/zsh")
  :if (memq window-system '(mac ns x))
  :config
  (setq exec-path-from-shell-variables '("PATH" "GOPATH" "PYTHONPATH"))
  (exec-path-from-shell-initialize))
;;; Set size of the starting Window
;%  I like a wider window. Setting it initially saves an operation.
(setq initial-frame-alist '((top . 1)
                (left . 450)
                (width . 101)
                (height . 90)))
;;; Setting modifier keys
;%   ==> adjust here for operating system
;%  See this [[http://ergoemacs.org/emacs/emacs_hyper_super_keys.html][ for more information.]]
;%  set keys for Apple keyboard, for emacs in OS X
;%  Source http://xahlee.info/emacs/emacs/emacs_hyper_super_keys.html
;%  Seems to only work in the GUI mode.
(setq mac-command-modifier 'meta) ; make cmd key do Meta
(setq mac-option-modifier 'super) ; make option key do Super.
(setq mac-control-modifier 'control) ; make Control key do Control
(setq mac-function-modifier 'hyper)  ; make Fn key do Hyper. Only works on Apple produced keyboards.
(setq mac-right-command-modifier 'hyper)
;;; Move cursor to place at last save
;%  Enable save-place-mode
(save-place-mode 1)
;%  Optionally specify the file to save cursor positions
(setq save-place-file "~/e29fewpackages/places")
;;; Setting section is finished
(message "Finished settings configuration.") 
;%  ***************************** User-defined functions section ***********************************************  
;; Start user-defined functions section
(message "User defined functions in alphabetical order.") 

;;; create-org-table-with-caption
;%  This interactive function prompts the user for the number of rows, columns, and caption of the table.
(defun create-org-table-with-caption ()
"This interactive function prompts the user for the number of rows. columns, and the caption of the table."
  (interactive)
  (let ((rows (read-number "Enter the number of rows: "))
        (cols (read-number "Enter the number of columns: "))
        (label (read-string "Enter the table label: "))
        (caption (read-string "Enter the table's caption: ")))
    (insert (format "#+CAPTION: %s \\label{%s}\n" caption label))
    (insert (format "#+NAME: %s\n" label))
    (insert "|")
    (dotimes (_ cols)
      (insert "----+"))
    (insert "\n|")
    ;;(insert "|")
    (dotimes (col cols)
      (insert (format " %c |" (+ ?A col))))
    (insert "\n|")
    (dotimes (_ cols)
      (insert "----+"))
    (insert "\n")
    (dotimes (_ rows)
      (insert "|")
      (dotimes (_ cols)
        (insert "     |"))
      (insert "\n"))
    (insert "|")
    (dotimes (_ cols)
      (insert "----+"))))
;;; find file and go to line number
;%  interactively enter the file name and line number in the minibuffer
(defun find-file-at-line (file line)
  "Open FILE on LINE."
  (interactive "fFile: \nNLine: \n")
  (find-file file)
  (goto-line line))
