init.el

;;; ffap: find file at point
;%  https://unix.stackexchange.com/questions/691444/how-do-i-open-a-file-at-specific-line-in-a-running-emacs
;%  have ffap pick up line number and goto-line
;%  found on emacswiki : https://www.emacswiki.org/emacs/FindFileAtPoint#h5o-6
(defvar ffap-file-at-point-line-number nil
  "Variable to hold line number from the last `ffap-file-at-point' call.")
(defadvice ffap-file-at-point (after ffap-store-line-number activate)
  "Search `ffap-string-at-point' for a line number pattern and
    save it in `ffap-file-at-point-line-number' variable."
  (let* ((string (ffap-string-at-point)) ;; string/name definition copied from `ffap-string-at-point'
         (name
          (or (condition-case nil
                  (and (not (string-match "//" string)) ; foo.com://bar
                       (substitute-in-file-name string))
                (error nil))
              string))
         (line-number-string 
          (and (string-match ":[0-9]+" name)
               (substring name (1+ (match-beginning 0)) (match-end 0))))
         (line-number
          (and line-number-string
               (string-to-number line-number-string))))
    (if (and line-number (> line-number 0)) 
        (setq ffap-file-at-point-line-number line-number)
      (setq ffap-file-at-point-line-number nil))))

(defadvice find-file-at-point (after ffap-goto-line-number activate)
  "If `ffap-file-at-point-line-number' is non-nil goto this line."
  (when ffap-file-at-point-line-number
    (goto-line ffap-file-at-point-line-number)
    (setq ffap-file-at-point-line-number nil)))
;;; insert-org-captioned-figure
;%  The function prompts the user for the image file path and name, the label, and the caption.
(defun insert-org-captioned-figure ()
  "Insert a captioned figure in Org-mode."
  (interactive)
  (let ((image-name (read-string "Enter the image file path: "))
        (label (read-string "Enter the figure label: "))
        (caption (read-string "Enter the figure caption: ")))
    (insert (format "#+CAPTION: %s \\label{%s}\n" caption label))
    (insert (format "#+NAME: %s\n" label))
    (insert (format "[[file:%s]]\n" image-name))))
;;; Convert a selected latex list of items to a org-mode list
;%  To use this function, select the region containing the LaTeX list and run:
;%  M-x latex-to-org-list-region
(defun latex-to-org-list-region (start end)
  "Convert a LaTeX itemize list in the region to an Org-mode list."
  (interactive "r")
  (save-excursion
    (goto-char start)
    (while (re-search-forward "\\\\item" end t)
      (replace-match "-"))))
;%  ;;; Open the Daily Log headline while keeping the other headline closed.
;%  (defun org-open-specific-headline (headline)
;%    "Open the specific top-level HEADLINE while keeping others closed."
;%    (goto-char (point-min))
;%    (org-overview)
;%    (if (re-search-forward (format "^\\* %s" (regexp-quote headline)) nil t)
;%        (org-show-children 3)
;%      (message "Headline not found")))
;% 
;%  (defun my-org-mode-setup ()
;%    "Custom setup for Org mode."
;%    (org-open-specific-headline "Daily Log"))
;%  (add-hook 'org-mode-hook 'my-org-mode-setup)
;% 
;% 
;%  ;;; Moves cursor to headline with the restart tag.
;%  ;%  Waits for the  my-org-mode-setup function to run first.
;%  (defun my-open-log-file-and-move-above-tag ()
;%    "If the current buffer's file name starts with 'log', move the cursor above a second-level headline with a specific tag."
;%    (let ((tag "restart-here"))
;%      (when (and buffer-file-name
;%                 (string-prefix-p "log" (file-name-nondirectory buffer-file-name)))
;%        (goto-char (point-min))
;%        (if (re-search-forward (format "^\\*\\* .*:%s:" tag) nil t)
;%           (forward-line -1)
;%          (message "Tag not found")))))
;% 
;%  ;defun org-open-specific-headline (headline)
;%  ; "Open the specific top-level HEADLINE while keeping others closed.
;%  ;hen move the cursor to the line above the second-level headline with the tag."
;%  ; (goto-char (point-min))
;%  ; (org-overview)
;%  ; (if (re-search-forward (format "^\\* %s" (regexp-quote headline)) nil t)
;%  ;     (progn
;%  ;       (org-show-children 3)
;%  ;       (when (re-search-forward "^\\*\\* .*:restart-here:" nil t)
;%  ;         (beginning-of-line)
;%  ;         (forward-line -1)))
;%  ;   (message "Headline not found")))
;% 
;% 
;% 
;%  (defun my-delayed-org-setup ()
;%    "Run my-org-mode-setup and then my-open-log-file-and-move-above-tag."
;%    (my-org-mode-setup)
;%    (run-at-time "0.1 sec" nil 'my-open-log-file-and-move-above-tag))
;% 
;%  (add-hook 'org-mode-hook 'my-delayed-org-setup)
;;; Open a file and move to a headline with a specific tag
;%  The default tag is restart-here.
;%  Example usage:
;%  (open-org-file-and-move-to-tag "~/path/to/your/file.org" "your-tag")
(defun open-org-file-and-move-to-tag (file &optional tag)
  "Open an Org file and move the cursor below a headline with a specific TAG.
If TAG is not provided, use a hardcoded default tag.
You have have to adjust the headline level in the funciton.
The regular expression ^\\*\\* .*:%s: is used to search for second-level headlines (those starting with **) with the specified tag."
  (interactive "fOrg file: \nsTag (leave empty for default): ")
  (let ((tag (if (string= tag "") "restart-here" tag)))
    (find-file file)
    (goto-char (point-min))
    (if (re-search-forward (format "^\\*\\* .*:%s:" tag) nil t)
        (org-end-of-subtree)
      (message "Tag not found"))))
;;; Play a YouTube video with mpv
;%  You insert the YouTube url in the minibufffer.
;%  You have to install mpv with a package manager and another binary package.
;%  sudo curl -L https://yt-dl.org/downloads/latest/youtube-dl -o /usr/local/bin/youtube-dl
;%  sudo chmod a+rx /usr/local/bin/youtube-dl
(defun play-youtube-video (url)
  "Play a YouTube video with mpv."
  (interactive "sYouTube URL: ")
  (start-process "mpv" nil "mpv" URL))  
;;; Protesilous Starvou functions
;;;; Functions to open popup menu when Emacs server is running
;%  Source: https://www.youtube.com/watch?v=vbWxT8tht9A&list=PL8Bwba5vnQK14z96Gil86pLMDO2GnOhQ6
;%  This function is used to capture notes when Emacs is not open.
;%  This idea could be harness for other purposes.
;%  You will need to map the 
(defun prot-window-delete-popup-frame (&rest _)
  "Kill selected selected frame if it has parameter `prot-window-popup-frame'.
Use this function via a hook."
  (when (frame-parameter nil 'prot-window-popup-frame)
    (delete-frame)))
(defmacro prot-window-define-with-popup-frame (command)
  "Define interactive function which calls COMMAND in a new frame.
Make the new frame have the `prot-window-popup-frame' parameter."
  `(defun ,(intern (format "prot-window-popup-%s" command)) ()
     ,(format "Run `%s' in a popup frame with `prot-window-popup-frame' parameter.
Also see `prot-window-delete-popup-frame'." command)
     (interactive)
     (let ((frame (make-frame '((prot-window-popup-frame . t)))))
       (select-frame frame)
       (switch-to-buffer " prot-window-hidden-buffer-for-popup-frame")
       (condition-case nil
           (call-interactively ',command)
         ((quit error user-error)
          (delete-frame frame))))))
(declare-function org-capture "org-capture" (&optional goto keys))
(defvar org-capture-after-finalize-hook)

;;;###autoload (autoload 'prot-window-popup-org-capture "prot-window")
(prot-window-define-with-popup-frame org-capture)
(add-hook 'org-capture-after-finalize-hook #'prot-window-delete-popup-frame)

;%  (declare-function tmr "tmr" (time &optional description acknowledgep))
;%  (defvar tmr-timer-created-functions)
;% 
;%  ;;;###autoload (autoload 'prot-window-popup-tmr "prot-window")
;%  (prot-window-define-with-popup-frame tmr)
;% 
;%  (add-hook 'tmr-timer-created-functions #'prot-window-delete-popup-frame)
