init.org
***** The emacsclient calls that need ot be bound to system-wide keys
The emacsclient is an Emac version agnostic.
#+BEGIN_SRC bash
`alias oc="emacslient -e '(prot-window-popup-org-capture)'"`
`emacsclient -e '(prot-window-popup-tmr)'`
#+END_SRC
*** Reload the initialization file after editing it in Emacs
#+BEGIN_SRC emacs-lisp
(defun reload-init-e29f ()
  "Reload the init.el file for e29org. Edit the path to suite your needs."
  (interactive)
  (load-file "~/e29fewpackages/init.el"))
#+END_SRC
*** Spawn a new shell with the supplied title
#+BEGIN_SRC emacs-lisp
(defun spawn-shell (name)
  "Invoke shell test"
  (interactive "MName of shell buffer to create: ")
  (pop-to-buffer (get-buffer-create (generate-new-buffer-name name)))
  (shell (current-buffer))
  (process-send-string nil "echo 'test1'\n")
  (process-send-string nil "echo 'test2'\n"))
#+END_SRC
*** Move the cursor to the minibuffer without using the mouse
From video https://www.youtube.com/watch?v=X8c_TrGfYcM&t=15s using Emacs as a multiplexer."
Derived from http://stackoverflow.com/a/4116113/446256.
#+BEGIN_SRC emacs-lisp
(defun switch-to-minibuffer ()
  "Switch to minibuffer window."
  (interactive)
  (if (active-minibuffer-window)
      (select-window (active-minibuffer-window))
    (error "Minibuffer is not active")))
(global-set-key "\C-cm" 'switch-to-minibuffer) ;; Bind to `C-c m' for minibuffer.
(message "End of user-defined functions.")
#+END_SRC

# ***************************** Package configuration section ***********************************************

** Package configuration section
#+BEGIN_SRC emacs-lisp
(message "Start package configurations in alphabetical order by package name.")
(message "Start A package configurations")
#+END_SRC
*** A
**** AUCTeX
This is the more advanced LaTeX.
Emacs has native LaTeX support that AUCTeX is an alternative to.
#+BEGIN_SRC emacs-lisp
(use-package auctex
  :straight t
  :defer t)
(message "Start C package configurations")
#+END_SRC
*** C
**** Citar
Citar is a bibliographic management system that is an alternative to org-ref.
Citar can operate in tex and org file whereas org-ref is limited to org-mode files.
#+BEGIN_SRC emacs-lisp
(use-package citar
  :straight t
  :bind (("C-c b" . citar-insert-citation)
         :map minibuffer-local-map
         ("M-b" . citar-insert-preset))
  :custom
    (citar-bibliography '("/Users/blaine/Documents/global.bib"))
    (citar-library-paths '("/Users/blaine/0papersLabeled") '("/Users/blaine/0booksUnlabeled"))
    (citar-library-file-extensions '("pdf" "epub"))
  :hook
#+END_SRC
**** enable autocompletion in buffer of citekeys
#+BEGIN_SRC emacs-lisp
    (LaTeX-mode . citar-capf-setup)
    (org-mode . citar-capf-setup))
#+END_SRC
**** company-box
***** formats the options delivered by the company autocompletion system
#+BEGIN_SRC emacs-lisp
(use-package company-box
    :straight t
    :config
    (setq company-box-max-candidates 50
          company-frontends '(company-tng-frontend company-box-frontend)
          company-box-icons-alist 'company-box-icons-all-the-icons))
(with-eval-after-load 'company
  (define-key company-active-map
              (kbd "TAB")
              #'company-complete-common-or-cycle)
  (define-key company-active-map
              (kbd "<backtab>")
              (lambda ()
                (interactive)
                (company-complete-common-or-cycle -1))))
(with-eval-after-load 'company
  (define-key company-active-map (kbd "M-.") #'company-show-location)
  (define-key company-active-map (kbd "RET") nil))
#+END_SRC
**** Company Configuration
Source: https://github.com/Exafunction/codeium.el
#+BEGIN_SRC emacs-lisp
(use-package company
  :straight t    
  :defer 0.1
  :hook ((emacs-lisp-mode . (lambda ()
                              (setq-local company-backends '(company-elisp))))
         (emacs-lisp-mode . company-mode))
  :config
  (global-company-mode t)
  (company-tng-configure-default) ; restore old tab behavior
  (setq-default
   company-idle-delay 0.05
   company-require-match nil
   company-minimum-prefix-length 1
   company-frontends '(company-preview-frontend)
   company-frontends '(company-pseudo-tooltip-frontend company-preview-frontend)
   ))
(message "Finished C package configurations")
(message "Started L packages configurations")
#+END_SRC
*** L
**** lsp-mode
This mode is required to be able to use other lsp modes.
#+BEGIN_SRC emacs-lisp
(use-package lsp-mode
  :straight t
  :commands (lsp lsp-deferred)
  :bind (:map lsp-mode-map
              ("C-c d" . lsp-describe-thing-at-point)
              ("C-c a" . lsp-execute-code-action))
  :bind-keymap ("C-c l" . lsp-command-map)
  :hook ((latex-mode . lsp-deferred)
  (lsp-mode . lsp-enable-which-key-integration))
  :config
  (lsp-enable-which-key-integration t)
  (setq lsp-headerline-breadcrumb-enable nil))
#+END_SRC
**** lsp-latex
#+BEGIN_SRC emacs-lisp
(use-package lsp-latex
  :straight t
  :after lsp-mode
  :hook (latex-mode . lsp-latex-enable))
#+END_SRC
**** lsp-ltex (the languagetool lsp server)
#+BEGIN_SRC emacs-lisp
(use-package lsp-ltex
  :straight t
  :after lsp-mode
  :hook ((text-mode . lsp)
         (latex-mode . lsp)
         (org-mode . lsp))
  :config
  (setq lsp-ltex-language "en-US")
  :init
  (setq lsp-ltex-version "16.0.0"))
#+END_SRC
**** lsp-ui
#+BEGIN_SRC emacs-lisp
(use-package lsp-ui
    :straight t
    :commands lsp-ui-mode)
#+END_SRC
**** lsp-treemacs
#+BEGIN_SRC emacs-lisp
(use-package lsp-treemacs 
       :straight t
       :commands lsp-treemacs-errors-list)       
(message "Finished L package configurations")
(message "Start M package configurations")
#+END_SRC
*** M
**** Marginalia Configuration
This package produces a transient list of optional commands.
#+BEGIN_SRC emacs-lisp
(use-package marginalia
  :straight (marginalia :type git :host github :repo "minad/marginalia")
  :config
  (marginalia-mode))
(customize-set-variable 'marginalia-annotators '(marginalia-annotators-heavy marginalia-annotators-light nil))
(marginalia-mode 1)
#+END_SRC
**** Math-preview that is mode agnostic
Uses MathJaX.
You have to download and install the bindary
#+BEGIN_SRC emacs-lisp
(use-package math-preview
  :straight t
  :custom (math-preview-command "/Users/blaine/.nvm/versions/node/v22.4.0/lib/node_modules/math-preview/math-preview.js"))s
(message "Finished M packages configurations")

(message "Start O package configurations")
#+END_SRC
*** O
**** Org-agenda
This can be complex to configure.
#+BEGIN_SRC emacs-lisp
(setq org-agenda-start-with-log-mode t)
(setq org-log-done 'time)
(setq org-log-into-drawer t)
#+END_SRC
***** Follow links
#+BEGIN_SRC emacs-lisp
(setq org-return-follows-link t)
#+END_SRC
***** Treat *.org files as org-mode files
#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("\\.org\\'" . org-mode))
#+END_SRC
***** Hide the emphasis markers so you just see bold text as BOLD-TEXT and not *BOLD-TEXT*
#+BEGIN_SRC emacs-lisp
(setq org-hide-emphasis-markers t)
#+END_SRC
