init.org
***** Stoup's fonts for org
These settings have been added to the customization section.
They can only be called once in an init.el file.
#+BEGIN-COMMENT
(let* ((variable-tuple
(cond ((x-list-fonts "ETBembo")         '(:font "ETBembo"))
((x-list-fonts "Source Sans Pro") '(:font "Source Sans Pro"))
((x-list-fonts "Lucida Grande")   '(:font "Lucida Grande"))
((x-list-fonts "Verdana")         '(:font "Verdana"))
((x-family-fonts "Sans Serif")    '(:family "Sans Serif"))
(nil (warn "Cannot find a Sans Serif Font.  Install Source Sans Pro."))))
(base-font-color     (face-foreground 'default nil 'default))
(headline           `(:inherit default :weight bold :foreground ,base-font-color)))

(custom-theme-set-faces
'user
`(org-level-8 ((t (,@headline ,@variable-tuple))))
`(org-level-7 ((t (,@headline ,@variable-tuple))))
`(org-level-6 ((t (,@headline ,@variable-tuple))))
`(org-level-5 ((t (,@headline ,@variable-tuple))))
`(org-level-4 ((t (,@headline ,@variable-tuple :height 1.1))))
`(org-level-3 ((t (,@headline ,@variable-tuple :height 1.2))))
`(org-level-2 ((t (,@headline ,@variable-tuple :height 1.3))))
`(org-level-1 ((t (,@headline ,@variable-tuple :height 1.5))))
`(org-document-title ((t (,@headline ,@variable-tuple :height 1.6 :underline nil))))))
#+END_COMMENT

***** Org-agenda key-bindings
#+BEGIN_SRC emacs-lisp
(define-key global-map "\C-ca" 'org-agenda)
(setq org-log-done t)
(define-key global-map "\C-cc" 'org-capture)
(define-key global-map "\C-cl" 'org-store-link)
(global-set-key (kbd "C-c v") 'org-refile)
#+END_SRC
Note that I have more capture commands below.
#+BEGIN_SRC emacs-lisp
(setq org-columns-default-format "%50ITEM(Task) %10CLOCKSUM %16TIMESTAMP_IA")
#+END_SRC
***** Source of TODO keywords read into org-agenda
#+BEGIN_SRC emacs-lisp
(setq org-agenda-files '("/Users/blaine/.notes"
                         "/Users/blaine/gtd/tasks/JournalArticles.org"
                         "/Users/blaine/0573CrystalDetectionMeasurement/log0573.org"
                         "/Users/blaine/0598tenRulesWritingLog/cb/log0598tsrWritingLog.org"
                         "/Users/blaine/gtd/tasks/Proposals.org"
                         "/Users/blaine/1019NIHemofat/cb/log1019.org"
                         "/Users/blaine/gtd/tasks/Books.org"
                         "/Users/blaine/gtd/tasks/Talks.org"
                         "/Users/blaine/gtd/tasks/Posters.org"
                         "/Users/blaine/gtd/tasks/ManuscriptReviews.org"
                         "/Users/blaine/gtd/tasks/Private.org"
                         "/Users/blaine/gtd/tasks/Service.org"
                         "/Users/blaine/gtd/tasks/Teaching.org"
                         "/Users/blaine/gtd/tasks/Workshops.org"
                         "/Users/blaine/gtd/tasks/springsem24.org"
                         "/Users/blaine/gtd/tasks/summersem24.org"
                         "/Users/blaine/gtd/tasks/fallsem24.org"))
#+END_SRC
***** Order of TODO keywords
Cycle through these keywords with shift right or left arrows.
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
        '((sequence "TODO(t)" "PLANNING(p)" "IN-PROGRESS(i@/!)"  "WAITING(w!)" "CAL(a)"  "PROJ(j)" "|" "DONE(d!)" "SOMEDAY(s!)" "CANCELLED(c!)"  )))
#+END_SRC
***** TODO keyword colors
#+BEGIN_SRC emacs-lisp
(setq org-todo-keyword-faces
      '(
        ("TODO" . (:foreground "Red" :weight bold))
        ("PLANNING" . (:foreground "DeepPink" :weight bold))
        ("IN-PROGRESS" . (:foreground "Cyan" :weight bold))
        ("WAITING" . (:foreground "DarkOrange" :weight bold))
        ("CAL" . (:foreground "GoldenOrange" :weight bold))
        ("PROJ" . (:foreground "LimeGreen" :weight bold))
        ("DONE" . (:foreground "LimeGreen" :weight bold))
        ("SOMEDAY" . (:foreground "LimeGreen" :weight bold))
        ("CANCELLED" . (:foreground "LightGray" :weight bold))
        ))
#+END_SRC
***** Press C-c r to select the log file from the list of log files for insert todos with C-c t
The function will then search for the heading with the specified tag and append the TODO item at the bottom of the TODO list under that heading.
#+BEGIN_SRC emacs-lisp
(setq my-org-refile-directories '(
("/Users/blaine/gtd/tasks/JournalArticles.org" :maxlevel . 3)
("/Users/blaine/gtd/tasks/Proposals.org" :maxlevel . 3)
("/Users/blaine/0598tenRulesWritingLog/cb/log0598tsrWritingLog.org" :maxlevel . 3)
))
#+END_SRC
****** Writing project log files as refile targets
The TODOs are at the 3rd headline level.
#+BEGIN_SRC emacs-lisp
(setq my-org-refile-targets '(
    ("/Users/blaine/0573CrystalDetectionMeasurement/log0573.org" :maxlevel . 3)
    ("/Users/blaine/0598tenRulesWritingLog/cb/log0598tsrWritingLog.org" :maxlevel . 3)
    ("/Users/blaine/1019NIHemofat/cb/log1019.org" :maxlevel . 3)
   ))

(defun my-select-org-refile-target ()
     "Prompt for an org refile target from a list of directories."
     (interactive)
     (let ((target (completing-read "Select refile target: " my-org-refile-targets)))
       (setq my-org-refile-targets `((,target :maxlevel . 3)))))

(setq org-refile-use-outline-path 'file)
(global-set-key (kbd "C-c r") 'my-select-org-refile-target)
#+END_SRC
****** Append TODO item at bottom of TODO list in writing project log file.
I like to use project ID number and 'do' at the tag.
#+BEGIN_SRC emacs-lisp
(defun my-append-todo-to-heading (tag todo-text)
     "Append TODO-TEXT to the bottom of a TODO list under a heading with TAG. Enter the tag without the flanking colons."
         (interactive "sTag: \nsTODO: ")
         (save-excursion
           (goto-char (point-min))
           (if (re-search-forward (format "^\*+ .* :%s:" tag) nil t)
               (progn
                 (org-end-of-subtree t t)
                 (insert (format "*** TODO %s \n" todo-text)))
             (message "Heading with tag %s not found" tag))))
(global-set-key (kbd "C-c t") 'my-append-todo-to-heading)
(message "Finished refile target configuration.")
#+END_SRC
