init.el

;;;;; Customized agenda views
;% 
;% These are my customized agenda views by project.
;% The letter is the last parameter.
;% For example, enter ~C-c a b~ and then enter 402 at the prompt to list all active tasks related to 402 tasks.
;% 
;% I learned about this approach [[https://tlestang.github.io/blog/keeping-track-of-tasks-and-projects-using-emacs-and-org-mode.html][here]].
;% 
;% The CATEGORY keyword resides inside of a Properties drawer.
;% The drawers are usually closed.
;% I am having trouble opening my drawers in may org files.
;% In addition, I do not want to have to add a drawer to each TODO.
;% 
;% I am loving Tags now.
;% I may switch to using Tags because they are visible in org files.
;% I tried and they are not leading to the expect list of TODOs in org-agenda.
;% I am stumped.
;% 
;% In the meantime, enter ~C-c \~ inside JournalArticles.org to narrow the focus to the list of TODOs or enter ~C-c i b~ to get an indirect buffer.
(setq org-agenda-custom-commands
      '(
    ("b"
             "List of all active 1019 tasks."
             tags-todo
             "1019\"/TODO|INITIATED|WAITING")
    ("c"
             "List of all active 523 RNA-drug crystallization review paper tasks."
             tags-todo
             "CATEGORY=\"523\"/TODO|INITIATED|WAITING")
    ("d"
             "List of all active 0527CrystalDetectionByAI tasks."
             tags-todo
             "CATEGORY=\"527\"/TODO|INITIATED|WAITING")
    ("e"
            "List of all active 0032RNA32merEditingSite tasks."
            tags-todo
            "CATEGORY=\"32\"/TODO|INITIATED|WAITING")

    ("l"
             "List of all active 0598tenRulesWritingProjectLog tasks."
             tags-todo
            "CATEGORY=\"598\"/TODO|INITIATED|WAITING")
    ("e"
            "List of all active 0495emofat4mx tasks."
            tags-todo
            "CATEGORY=\"495\"/TODO|INITIATED|WAITING")
    ("r"
            "List of all active 0466ReproDSD tasks."
            tags-todo
            "CATEGORY=\"515\"/TODO|INITIATED|WAITING")
    ("s"
            "List of all active 0515CrystallizationSupports tasks."
            tags-todo
            "CATEGORY=\"515\"/TODO|INITIATED|WAITING")
    ("P"
         "List of all projects"
         tags
         "LEVEL=2/PROJ")))
(message "Finished org-agenda custum command configuration.")
(message "Fnished O package configurations")

(message "Start P package configurations")
;;; P
;;;; pdf-tools
;%  Emacs has a built-in DocView package that can display PDFs but it is not as versatile as pdf-tools.
;%  You will likely by prompted to run pdf-tools-install to compile it.
;%  It is needed to be able to annotate PDF from inside Emacs.
;%  I have not gotten that far.
(use-package pdf-tools
 :straight t    
 :pin manual ;; manually update
 :config
 ;; initialise
 (pdf-tools-install)
 ;; open pdfs scaled to fit width
 (setq-default pdf-view-display-size 'fit-width)
 ;; use normal isearch
 (define-key pdf-view-mode-map (kbd "C-s") 'isearch-forward)
 :custom
 (pdf-annot-activate-created-annotations t "automatically annotate highlights"))
(message "Finished P package configurations.")
 
(message "Start S package configurations.")
;;; S
;;;; show-key 
;%  Conflicts with tmux-pane
;% #+BEGIN_COMMENT
;% (straight-use-package
;%   '(showkey :type git :local-repo "~/e29fewpackages/manual-install/showkey"))
;% (set-face-attribute 'default nil :height 240)
;% (require 'showkey)
;% #+END_COMMENT
;;;; The emacsclient call depends on the daemon or `server-mode'
;%  The emacsclient depends either running the server or a daemon.
;%  The server is easier to manage than the daemon because you will
;%  find to find the daemon and kill it after updating the init.el file.
;%  This package is built-in, so it does not need to be installed by straight.
(use-package server  
  :ensure nil
  :defer 1
  :config
  (unless (server-running-p)
    (server-start)))
(message "Finished S package configurations.")


(message "Start T package configurations.")
;;; T
;;;; tmux-pane
(use-package tmux-pane
   :straight (tmux-pane :type git :host github :repo "laishulu/emacs-tmux-pane"))

;;;; treemacs
