init.org
**** treemacs
Provides sidebar access to contents of the treemacs project directory
#+BEGIN_SRC emacs-lisp
(use-package treemacs
   :straight t
   :defer t
   :init
   (with-eval-after-load 'winum
     (define-key winum-keymap (kbd "M-0") #'treemacs-select-window))
   :config
   (progn
     (setq treemacs-collapse-dirs                   (if treemacs-python-executable 3 0)
           treemacs-deferred-git-apply-delay        0.5
           treemacs-directory-name-transformer      #'identity
           treemacs-display-in-side-window          t
           treemacs-eldoc-display                   'simple
           treemacs-file-event-delay                2000
           treemacs-file-extension-regex            treemacs-last-period-regex-value
           treemacs-file-follow-delay               0.2
           treemacs-file-name-transformer           #'identity
           treemacs-follow-after-init               t
           treemacs-expand-after-init               t
           treemacs-find-workspace-method           'find-for-file-or-pick-first
           treemacs-git-command-pipe                ""
           treemacs-goto-tag-strategy               'refetch-index
           treemacs-header-scroll-indicators        '(nil . "^^^^^^")
           treemacs-hide-dot-git-directory          t
           treemacs-indentation                     2
           treemacs-indentation-string              " "
           treemacs-is-never-other-window           nil
           treemacs-max-git-entries                 5000
           treemacs-missing-project-action          'ask
           treemacs-move-files-by-mouse-dragging    t
           treemacs-move-forward-on-expand          nil
           treemacs-no-png-images                   nil
           treemacs-no-delete-other-windows         t
           treemacs-project-follow-cleanup          nil
           treemacs-persist-file                    (expand-file-name ".cache/treemacs-persist" user-emacs-directory)
           treemacs-position                        'left
           treemacs-read-string-input               'from-child-frame
           treemacs-recenter-distance               0.1
           treemacs-recenter-after-file-follow      nil
           treemacs-recenter-after-tag-follow       nil
           treemacs-recenter-after-project-jump     'always
           treemacs-recenter-after-project-expand   'on-distance
           treemacs-litter-directories              '("/node_modules" "/.venv" "/.cask")
           treemacs-project-follow-into-home        nil
           treemacs-show-cursor                     nil
           treemacs-show-hidden-files               t
           treemacs-silent-filewatch                nil
           treemacs-silent-refresh                  nil
           treemacs-sorting                         'alphabetic-asc
           treemacs-select-when-already-in-treemacs 'move-back
           treemacs-space-between-root-nodes        t
           treemacs-tag-follow-cleanup              t
           treemacs-tag-follow-delay                1.5
           treemacs-text-scale                      nil
           treemacs-user-mode-line-format           nil
           treemacs-user-header-line-format         nil
           treemacs-wide-toggle-width               70
           treemacs-width                           35
           treemacs-width-increment                 1
           treemacs-width-is-initially-locked       t
           treemacs-workspace-switch-cleanup        nil)
             (treemacs-resize-icons 44)
             (treemacs-follow-mode t)
             (treemacs-filewatch-mode t)
             (treemacs-fringe-indicator-mode 'always)
             (when treemacs-python-executable
               (treemacs-git-commit-diff-mode t))
             (pcase (cons (not (null (executable-find "git")))
                          (not (null treemacs-python-executable)))
               (`(t . t)
                (treemacs-git-mode 'deferred))
               (`(t . _)
                (treemacs-git-mode 'simple)))
             (treemacs-hide-gitignored-files-mode nil))
           :bind
           (:map global-map
                 ("M-0"       . treemacs-select-window)
                 ("C-x t 1"   . treemacs-delete-other-windows)
                 ("C-x t t"   . treemacs)
                 ("C-x t d"   . treemacs-select-directory)
                 ("C-x t B"   . treemacs-bookmark)
                 ("C-x t C-t" . treemacs-find-file)
                 ("C-x t M-t" . treemacs-find-tag)))
#+END_SRC
The default width and height of the icons is 22 pixels. If you are
using a Hi-DPI display, uncomment this to double the icon size.

**** treemacs-protjectile
#+BEGIN_SRC emacs-lisp
(use-package treemacs-projectile
  :after (treemacs projectile)
  :straight t)
#+END_SRC
**** treemacs-icons-dired
#+BEGIN_SRC emacs-lisp
(use-package treemacs-icons-dired
  :hook (dired-mode . treemacs-icons-dired-enable-once)
  :straight t)
#+END_SRC
**** treemacs-perspective
treemacs-perspective if you use perspective.el vs. persp-mode
#+BEGIN_SRC emacs-lisp
(use-package treemacs-persp 
  :after (treemacs persp-mode) ;;or perspective vs. persp-mode
  :straight t
  :config (treemacs-set-scope-type 'Perspectives))
#+END_SRC
**** treemacs start on boot
#+BEGIN_SRC emacs-lisp
(treemacs-start-on-boot)
(message "Finished T package configurations.")

(message "Start U package configurations.")
#+END_SRC
*** U
**** undo-tree
The displayed undo tree is very helpful.
#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :straight t
  :config
  (global-undo-tree-mode 1)) 
(message "Finished U package configurations.")   

(message "Start V package configurations.")
#+END_SRC
*** V
**** vterm
One of five terminal type available in Emacs.
See https://github.com/akermu/emacs-libvterm for configuration of init.el and .zshrc
#+BEGIN_SRC emacs-lisp
(use-package vterm
  :straight t)
(define-key vterm-mode-map (kbd "C-q") #'vterm-send-next-key)
#+END_SRC
**** vertico
#+BEGIN_SRC emacs-lisp
(use-package vertico
  :straight t
  :init
  (vertico-mode)
#+END_SRC
**** Different scroll margin
**** (setq vertico-scroll-margin 0)
**** Show more candidates
#+BEGIN_SRC emacs-lisp
  (setq vertico-count 20)
#+END_SRC
**** Grow and shrink the Vertico minibuffer
#+BEGIN_SRC emacs-lisp
  (setq vertico-resize t)
#+END_SRC
**** Optionally enable cycling for `vertico-next' and `vertico-previous'.
#+BEGIN_SRC emacs-lisp
  (setq vertico-cycle t))
(message "Finished V package configurations.") 

(message "Start package configurations W")
(message "Finished W package configurations.") 
#+END_SRC
*** Y
#+BEGIN_SRC emacs-lisp
(message "Start package configurations Y")
#+END_SRC
**** yasnippet
The popular snippet creator and manager package,
#+BEGIN_SRC emacs-lisp
(use-package yasnippet
  :straight t    
  :config
  (yas-global-mode 1))
(global-set-key "\C-o" 'yas-expand)
(global-set-key "\C-c y i" 'yas-insert-snippet)
(global-set-key "\C-c y n" 'yas-new-snippet)
#+END_SRC
**** A cool hydra for finding snippets at point. Invoke with C-c y.
#+BEGIN_SRC emacs-lisp
(use-package hydra
  :straight t     
  :defer 2
  :bind ("C-c y" . hydra-yasnippet/body))
#+END_SRC
**** A popup menu for snippet selection
#+BEGIN_SRC emacs-lisp
(use-package popup
  :straight t)
#+END_SRC
Add some shortcuts in popup menu mode.
#+BEGIN_SRC emacs-lisp
(define-key popup-menu-keymap (kbd "M-n") 'popup-next)
(define-key popup-menu-keymap (kbd "TAB") 'popup-next)
(define-key popup-menu-keymap (kbd "M-p") 'popup-previous)
(defun yas/popup-isearch-prompt (prompt choices &optional display-fn)
  (when (featurep 'popup)
    (popup-menu*
     (mapcar
      (lambda (choice)
        (popup-make-item
         (or (and display-fn (funcall display-fn choice))
             choice)
         :value choice))
      choices)
     :prompt prompt
#+END_SRC
******* start isearch mode immediately
#+BEGIN_SRC emacs-lisp
     :isearch t)))
(setq yas/prompt-functions '(yas/popup-isearch-prompt yas/no-prompt))
(message "Finished Y package configurations.") 

#+END_SRC
